Revit 2026 API

# HermiteSplineCreate(IListXYZ, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static HermiteSpline Create(
	IList<XYZ> controlPoints,
	bool periodic
)
```
```vb
Public Shared Function Create (
	controlPoints As IList(Of XYZ),
	periodic As Boolean
) As HermiteSpline
```
```cpp
public:
static HermiteSpline^ Create(
	IList<XYZ^>^ controlPoints,
	bool periodic
)
```
```fsharp
static member Create :
        controlPoints : IList<XYZ> *
        periodic : bool -> HermiteSpline
```

#### Parameters

controlPoints IListXYZ

periodic Boolean

#### Return Value

HermiteSpline

#### Reference

HermiteSpline Class

Create Overload

Autodesk.Revit.DB Namespace